app/controllers/tool_controller.rb

SELECT max(words.id) as maxId,manualKind,max(words.concreteMethod) as maxMethod FROM `words` GROUP BY `words`.`manualKind`
SELECT `words`.* FROM `words` WHERE `words`.`manualKind` != ''
---
  def index
    @words = Word.all.where.not(manualKind:'').to_a.uniq {|word| word.manualKind}

SELECT `words`.`japanese_word` FROM `words` WHERE `words`.`japanese_word` = '日本語名1'
---
  def conv_method
    #変換後文字列生成
    conv_array = []
    word = Word.new
    conv_array.push(word.create_conv_multifilter_word(
                       {manualKind: conv_params[:manualKind],
                       concreteMethod: conv_params[:concreteMethod]}))
    conv_array.push(word.create_conv_word({japanese_word: conv_params[:japanese_word]})) if conv_params[:japanese_word] != ""

    render json: [{"conv_word": conv_array.join('_')}]

SELECT  `words`.* FROM `words` WHERE `words`.`japanese_word` = '日本語名1' ORDER BY `words`.`id` ASC LIMIT 1
---
  def conv_other
    #変換後文字列生成
    conv_array = []
    word = Word.new
    conv_array.push(word.create_conv_word({japanese_word: params[:word1]})) if params[:word1] != ""
    conv_array.push(word.create_conv_word({japanese_word: params[:word2]})) if params[:word2] != ""
    conv_array.push(word.create_conv_word({japanese_word: params[:word3]})) if params[:word3] != ""
    conv_other_word = conv_array.join('_')

SELECT  `words`.* FROM `words` WHERE `words`.`id` = 1 ORDER BY `words`.`id` ASC LIMIT 1
SELECT `words`.`concreteMethod`, `words`.`id` FROM `words` WHERE `words`.`manualKind` = '取得する1'
---
  def get_concrete
    manualKind = Word.where(id: params[:id]).first["manualKind"]
    render json: Word.where(manualKind: manualKind).select(:concreteMethod,:id)