app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = User.all.page(params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
---
  def destroy
    user = User.find(params[:id])