app/controllers/words_controller.rb

SELECT  DISTINCT `words`.* FROM `words` LIMIT 25 OFFSET 0
SELECT COUNT(DISTINCT `words`.`id`) FROM `words`
---
  def index
    @q = Word.ransack(params[:q])
    @words = @q.result(distinct: true).page(params[:page])

UPDATE `words` SET `manualKind` = '', `concreteMethod` = '', `updated_at` = '2020-01-25 15:07:29' WHERE `words`.`id` = 1
---
  def update
    if @word.update(word_params)

INSERT INTO `words` (`manualKind`, `concreteMethod`, `japanese_word`, `english_word`, `use`, `created_at`, `updated_at`) VALUES ('', '', '情報', 'info', '情報', '2020-01-25 08:28:00', '2020-01-25 08:28:00')
---
  def create
    @word = Word.new(word_params)
    if @word.save

SELECT  `words`.* FROM `words` WHERE `words`.`id` = 1 LIMIT 1
---
    def set_word
      @word = Word.find(params[:id])