app/models/word.rb

SELECT `words`.* FROM `words` WHERE (id:)
SELECT  `words`.* FROM `words` WHERE (id:1) LIMIT 11
SELECT  `words`.* FROM `words` WHERE (japanese_word:日本語名1) LIMIT 11
---
  def create_conv_word(conv_params)
      conv_array = []
      conv_params.each do |param|
        if Word.where(param).present?
          conv_array.push(Word.where(param).first["english_word"])
        end
      end
      conv_array.join('_').downcase